#运算符

#加  +
a = 2
b = 5
print(a+b)

#减 -
a = 7.3
b = 3.4
print(a-b)

#乘 *
a = 2
b = 4
print(2*4)

#乘方 **
a = 2
b = 3
print(a**b)

#除 /
a = 6
b = 4
print(a/b)

#整除 //
a = 9
b = 2
print(a//b)

#取余 %
a = 13
b = 4
print(a%b)

#左移 <<
a = 2
print(a<<2)

#右移 >>
a = 16
print(a>>4)

#按位与 &
a = 5
b = 3
print(a&b)#二进制位如果都为1则为1，否则为0，101&011 = 001

# 按位或 |
a = 5
b = 3
print(a|b)#二进制位如果都为0则为0，否则为1,101|011 = 111

# 按位异或 ^
a = 5
b = 3
print(a^b)#二进制位如果都相同的话为与之相反的，不同为1，否则为1,101|011 = 110

# 按位取反 ~
a = 5
print(~a) #记住公式 X取反就是 -（X+1）

##后面的大与小于的等就不一一详细说了
